/*
    10: Հակառակ կարգ
    Գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
    Որպես արդյունք ծրագիրը պետք է արտածի հաջորդականությունը հակառակ կարգով։ 
    Խնդիրը լուծելիս օգտագործել զանգված։
*/

#include <iostream>

int main()
{
    int N;
    std::cin >> N;
    int array[N];

    for (int i = 0; i < N; i++)
    {
        std::cin >> array[i];
    }

    for (int i = N - 1; i >= 0; i--)
    {
        std::cout << array[i] << " ";
    }

    std::cout << "\n";
}