/* 
    11: Վերջինից տարբեր
    Գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
    Որպես արդյունք ծրագիրը պետք է արտածի հաջորդականությունում վերջին տարրից տարբեր տարրերի քանակը։ 
    Խնդիրը լուծելիս օգտագործել զանգված։
*/

#include <iostream>

int main()
{
    int N;
    std::cin >> N;
    int array[N];
    int count = 0;

    for (int i = 0; i < N; i++)
    {
        std::cin >> array[i];
    }

    for (int i = N - 1; i >= 0; i--)
    {
        if (array[i] != array[N - 1])
        {
            count++;
        }
    }

    std::cout << count << "\n";
}