/*
    14: Զանգվածների տարբերություն
    Պահանջվում է գրել ծրագիր, որը մուտքում կստանա 10 երկարությամբ երկու ամբողջ թվերի հաջորդականություն 
    և կարտածի բոլոր այն տարրերը առաջին հաջորդականությունից, որոնք չկան երկրորդում։ 
    Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով և պետք է արտածվեն նույն հերթականությամբ ինչպես ներմուծվել են։ 
    Խնդիրը լուծելիս օգտագործել զանգված։ 
*/

#include <iostream>

int main()
{
    int N;
    std::cin >> N;
    int array[N];

    for (int i = 0; i < N; i++)
    {
        std::cin >> array[i];
    }

    for (int i = 0; i < N; i++)
    {
        if (array[i] < 0)
        {
            std::cout << array[i] << " ";
        }
    }

    for (int i = 0; i < N; i++)
    {
        if (array[i] >= 0)
        {
            std::cout << array[i] << " ";
        }
    }

    std::cout << std::endl;
}