/*
    14: Զանգվածների տարբերություն
    Պահանջվում է գրել ծրագիր, որը մուտքում կստանա 10 երկարությամբ երկու ամբողջ թվերի հաջորդականություն 
    և կարտածի բոլոր այն տարրերը առաջին հաջորդականությունից, որոնք չկան երկրորդում։ 
    Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով և պետք է արտածվեն նույն հերթականությամբ ինչպես ներմուծվել են։ 
    Խնդիրը լուծելիս օգտագործել զանգված։ 
*/

#include <iostream>

int main()
{
    int n = 10;
    int a[n];
    int b[n];

    for (int i = 0; i < n; i++)
    {
        std::cin >> a[i];
    }

    for (int i = 0; i < n; i++)
    {
        std::cin >> b[i];
    }

    for (int i = 0; i < n; i++)
    {
        bool check = true;
        
        for (int j = 0; j < n; j++)
        {
            if (a[i] == b[j])
            {
                check = false;
                break;
            }
        }

        if (check)
        {
            std::cout << a[i] << " ";
        }
    }

    std::cout << "\n";
}