/*
    15: Հայելային գումար
    Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է n (n ≤ 1000) բնական թիվ, 
    ապա a0, a1, a2, ... an-1 ամբողջ թվերի հաջորդականությունը և կարտածի b0, b1, b2, ... b(n-1)/2։ Որտեղ bi = ai + an - i - 1։ 
    Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ 
    Խնդիրը լուծելիս օգտագործել զանգված։
*/

#include <iostream>

int main()
{
    int n;
    std::cin >> n;
    int a[n];
    int b[(n - 1) / 2];

    for (int i = 0; i < n; i++)
    {
        std::cin >> a[i];
    }

    for (int i = 0; i < n / 2; i++)
    {
        b[i] = a[i] + a[n - i - 1];
        std::cout << b[i] << " ";
    }

    std::cout << "\n";
}