/*
    6: Զույգ տարրերի քանակ
    Գրել ծրագիր, որը մուտքում կստանա N բնական թիվ, ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
    Անհրաժեշտ է, որ ծրագիրը արտածի հաջորդականության զույգ տարրերի քանակը։ Խնդիրը լուծելիս օգտագործել դինամիկ զանգված։
*/

#include <iostream>

int main()
{
    int n;
    std::cin >> n;
    int *dynArr = new int[n];
    
    for (int i = 0; i < n; i++)
    {
        std::cin >> dynArr[i];
    }

    int count = 0;
    for (int i = 0; i < n; i++)
    {
        if (dynArr[i] % 2 == 0)
        {
            count++;
        }
    }
    std::cout << count << "\n";
}