/*
    19: Պայմանով արտահայտություն
    Գրել ծրագիր, որը մոտքում կստանա A, B, C և D ամբողջ թվերը։ 
    Պահանջվում է արտածել A և D թվերի արտադրյալի ու B և C թվերի գումարի տարբերությունը, եթե A-ն գերազանցում է C֊ն։ 
    B և D թվերի գումարի և A֊ի արտադրյալը, եթե C-ն գերազանցում է A֊ն: 
    Հակառակ դեպքում բոլոր չորս թվերի գումարը։ 
*/

#include <iostream>

int main()
{
    int a, b, c, d;
    std::cin >> a >> b >> c >> d;

    if (a > c)
    {
        std::cout << (a * d) - (b + c) << std::endl;
    }
    else if (c > a)
    {
        std::cout << (b + d) * a << std::endl;
    }
    else
    {
        std::cout << a + b + c + d << std::endl;
    }
}